# DataFrame 결합

In [1]:
import pandas as pd
import numpy as np

## combine 메소드

In [ ]:
# 예제 Series 
group_1 = pd.Series([5,3,8])
group_2 = pd.Series([1,3,8,4])

print(group_1, group_2)

0    5
1    3
2    8
dtype: int64 0    1
1    3
2    8
3    4
dtype: int64

In [ ]:
# combine() 메소드를 사용하여 두 Series 객체를 결합
sum = group_1.combine(group_2, (lambda x, y: x + y))
sum

0     6.0
1     6.0
2    16.0
3     NaN
dtype: float64

In [ ]:
# 예제 DataFrame 생성
n=np.NaN
col = ['col1','col2','col3']
row = ['row1','row2','row3']
data1 = [[1,3,4],
         [n,8,2],
         [2,6,7]]
data2 = [[7,2,3],
         [2,4,2],
         [3,1,5]]
df1 = pd.DataFrame(data1,row,col)
df2 = pd.DataFrame(data2,row,col)

In [11]:
# 두 DataFrame을 각 Cell 값 중 큰 값만 사용하여 결합
df_max_values = df1.combine(df2,np.maximum)
df_max_values

      col1  col2  col3
row1   7.0     3     4
row2   NaN     8     2
row3   3.0     6     7

In [ ]:
# cell의 값을 합친 값들로 결합합니다.
df_sum_values = df1.combine(df2,lambda x, y: x + y)
df_sum_values

      col1  col2  col3
row1   8.0     5     7
row2   NaN    12     4
row3   5.0     7    12

In [15]:
df_sub_values = df1.combine(df2, lambda x, y: x - y, fill_value=0)
df_sub_values

      col1  col2  col3
row1  -6.0     1     1
row2  -2.0     4     0
row3  -1.0     5     2

## combine_first 메소드

In [16]:
# 예제 DataFrame 생성
n=np.NaN
col = ['col1','col2','col3']
row = ['row1','row2','row3']
data1 = [[n,n,1],
         [n,n,1],
         [1,1,1]]
data2 = [[2,2,2],
         [2,n,2],
         [2,1,2]]
df1 = pd.DataFrame(data1,row,col)
df2 = pd.DataFrame(data2,row,col)

In [20]:
df_after_combine = df1.combine_first(df2)
df_after_combine

      col1  col2  col3
row1   2.0   2.0     1
row2   2.0   NaN     1
row3   1.0   1.0     1

## join 메소드

In [3]:
import pymysql
import pandas as pd

### 기본 예제

In [20]:
df1 = pd.DataFrame({'col1':[1,2,3]},index=['row3','row2','row1'])
df2 = pd.DataFrame({'col2':[13,14]},index=['row4','row3'])
df3 = pd.DataFrame({'col1':[23,24]},index=['row4','row3'])

In [ ]:
# how=left인 경우 (기본값) df1의 인덱스를 기준으로 결합
df1.join(df2,how='left')

      col1  col2
row3     1  14.0
row2     2   NaN
row1     3   NaN

In [26]:
# how=right인 경우 df2의 인덱스를 기준으로 결합
df1.join(df2,how='right')

      col1  col2
row4   NaN    13
row3   1.0    14

In [27]:
# how=outer인 경우 df1와 df2의 인덱스의 합집합을 기준으로 결합
df1.join(df2,how='outer')

      col1  col2
row1   3.0   NaN
row2   2.0   NaN
row3   1.0  14.0
row4   NaN  13.0

In [28]:
# how=inner인 경우 df1와 df2의 인덱스의 교집합을 기준으로 결합
df1.join(df2,how='inner')

      col1  col2
row3     1    14

### Module02 데이터베이스의 Category와 Product 테이블 데이터 소스 예제

In [16]:
conn = pymysql.connect(
    host='127.0.0.1',
    user='root',
    password='P@ssw0rd',
    db='Module02'
)

try:
    df_category = pd.read_sql('SELECT * FROM Category', conn)
except Exception as e:
    print(e)
finally:
    conn.close()

df_category.index = df_category['CategoryNo']

C:\Users\gikpreet\AppData\Local\Temp\ipykernel_23196\1724002654.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_category = pd.read_sql('SELECT * FROM Category', conn)

In [18]:
conn.connect()

try:
    df_product = pd.read_sql('SELECT * FROM Product', conn)
except Exception as e:
    print(e)
finally:
    conn.close()

df_product.index = df_product['ProductNo']

C:\Users\gikpreet\AppData\Local\Temp\ipykernel_23196\2537883776.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_product = pd.read_sql('SELECT * FROM Product', conn)

In [ ]:
df_joined = df_product.join(df_category,on='CategoryNo',how='inner',lsuffix='category')
df_joined

,ProductNo,ProductName,Price,CategoryNocategory,CategoryNo,CategoryName
ProductNo,,,,,,
1,1,Fellowship of the rings,25000.0,1,1,Novel
2,2,The Two Towers,25000.0,1,1,Novel
3,3,Return of the King,25000.0,1,1,Novel
4,4,Science,45000.0,2,2,History
5,5,Newton,8000.0,2,2,History
6,6,Bourne Identity,18000.0,1,1,Novel
7,7,World War Z,20000.0,1,1,Novel

## merge() 메소드

### Sample Data

In [30]:
df2 = pd.DataFrame({'IDX2':['a','c','d'],'VAL':[5,6,7]})
df2

  IDX2  VAL
0    a    5
1    c    6
2    d    7

In [29]:
df1 = pd.DataFrame({'IDX1':['a','b','c','a'],'VAL':[1,2,3,4]})
df1

  IDX1  VAL
0    a    1
1    b    2
2    c    3
3    a    4

### 열 기준으로 병합

In [31]:
df_merged = df1.merge(df2, left_on='IDX1',right_on='IDX2')
df_merged

  IDX1  VAL_x IDX2  VAL_y
0    a      1    a      5
1    c      3    c      6
2    a      4    a      5

### suffixes를 통한 동명인 열 구분

In [32]:
df_merged = df1.merge(df2, left_on='IDX1',right_on='IDX2',suffixes=('_left','_right'))
df_merged

  IDX1  VAL_left IDX2  VAL_right
0    a         1    a          5
1    c         3    c          6
2    a         4    a          5

### 인덱스 기준으로 병합(left_index / right_index)

#### Sample Data

In [33]:
df3 = pd.DataFrame({'VAL1':[1,2,3]},index=['row1','row2','row3'])
df3

      VAL1
row1     1
row2     2
row3     3

In [34]:
df4 = pd.DataFrame({'VAL2':[4,5,6]},index=['row2','row3','row4'])
df4

      VAL2
row2     4
row3     5
row4     6

In [36]:
# 인덱스 기준으로 병합
df_merged = df3.merge(df4, left_index=True,right_index=True)
df_merged

      VAL1  VAL2
row2     2     4
row3     3     5

### 열과 인덱스를 혼합하여 병합

#### Sample Data

In [38]:
df5 = pd.DataFrame({'VAL1':[1,2,3]},index=['row1','row2','row3'])
df5

      VAL1
row1     1
row2     2
row3     3

In [39]:
df6 = pd.DataFrame({'IDX':['row2','row3','row4'],'VAL2':[4,5,6]})
df6

    IDX  VAL2
0  row2     4
1  row3     5
2  row4     6

In [ ]:
# 열과 인덱스를 혼합하여 병합
df_merged = df5.merge(df6, left_index=True,right_on='IDX')
df_merged

   VAL1   IDX  VAL2
0     2  row2     4
1     3  row3     5

### how 사용

#### Sample Data

In [41]:
df7 = pd.DataFrame({'IDX':['a','b','c','a'],'VAL':[1,2,3,4]})
df7

  IDX  VAL
0   a    1
1   b    2
2   c    3
3   a    4

In [42]:
df8 = pd.DataFrame({'IDX':['a','c','d'],'VAL':[5,6,7]})
df8

  IDX  VAL
0   a    5
1   c    6
2   d    7

In [43]:
# how=right인 경우 왼쪽 객체의 인덱스를 기준으로 병합
df_merged = df7.merge(df8,how='left',on='IDX')
df_merged

  IDX  VAL_x  VAL_y
0   a      1    5.0
1   b      2    NaN
2   c      3    6.0
3   a      4    5.0

In [ ]:
#how=right인 경우 오른쪽 객체의 인덱스를 기준으로 병합
df_merged = df7.merge(df8,how='right',on='IDX')
df_merged

  IDX  VAL_x  VAL_y
0   a    1.0      5
1   a    4.0      5
2   c    3.0      6
3   d    NaN      7

In [45]:
# how=inner인 경우 양쪽 객체 모두가 공통으로 갖는 인덱스를 기준으로 병합
df_merged = df7.merge(df8,how='inner',on='IDX')
df_merged

  IDX  VAL_x  VAL_y
0   a      1      5
1   c      3      6
2   a      4      5

In [47]:
# how=outer인 경우 양쪽 객체의 인덱스 모두를 기준으로 병합
df_merged = df7.merge(df8,how='outer',on='IDX')
df_merged

  IDX  VAL_x  VAL_y
0   a    1.0    5.0
1   a    4.0    5.0
2   b    2.0    NaN
3   c    3.0    6.0
4   d    NaN    7.0

### indicator인수를 통한 병합 정보 출력

In [48]:
df7.merge(df8,how='outer',on='IDX',indicator=True)

  IDX  VAL_x  VAL_y      _merge
0   a    1.0    5.0        both
1   a    4.0    5.0        both
2   b    2.0    NaN   left_only
3   c    3.0    6.0        both
4   d    NaN    7.0  right_only

#### validate를 통합 병합방식 검증

In [ ]:
# 1:m 이 아니므로 오류 출력
df7.merge(df8,how='outer',on='IDX',validate='1:m')

MergeError: Merge keys are not unique in left dataset; not a one-to-many merge

In [51]:
# validation pass
print(df7.merge(df8,how='outer',on='IDX',validate='m:1'))

  IDX  VAL_x  VAL_y
0   a    1.0    5.0
1   a    4.0    5.0
2   b    2.0    NaN
3   c    3.0    6.0
4   d    NaN    7.0

In [52]:
df9 = pd.DataFrame({'IDX1':['a','b']})
df9

  IDX1
0    a
1    b

In [53]:
df10 = pd.DataFrame({'IDX2':['c','d']})
df10

  IDX2
0    c
1    d

### how 인수로 cross 사용

In [54]:
df_merged = df9.merge(df10,how='cross')
df_merged

  IDX1 IDX2
0    a    c
1    a    d
2    b    c
3    b    d

## update 메소드

#### Sample Data

In [7]:
n = np.nan
df1 = pd.DataFrame({'A':[1,2,3],'B':[n,5,6]})
df1

   A    B
0  1  NaN
1  2  5.0
2  3  6.0

In [4]:
df2 = pd.DataFrame({'B':[24,n,26],'C':[37,38,39]})
df2

      B   C
0  24.0  37
1   NaN  38
2  26.0  39

### overwrite 파라미터를 사용하여 업데이트 방식을 설정

In [5]:
df1.update(df2,overwrite=True)
df1

   A     B
0  1  24.0
1  2   5.0
2  3  26.0

#### func_filter에 함수 사용

In [8]:
df1.update(df2,filter_func=lambda x: x==6)
df1

   A     B
0  1   NaN
1  2   5.0
2  3  26.0

## groupby() 메소드

### Sample Data

In [9]:
idx=['A','A','B','B','B','C','C','C','D','D','D','D','E','E','E']
col=['col1','col2','col3']
data = np.random.randint(0,9,(15,3))
df = pd.DataFrame(data=data, index=idx, columns=col).reset_index()

df

   index  col1  col2  col3
0      A     3     8     3
1      A     2     3     6
2      B     1     3     5
3      B     0     1     2
4      B     2     1     7
5      C     0     1     3
6      C     0     8     8
7      C     0     2     8
8      D     7     3     2
9      D     0     6     1
10     D     0     6     8
11     D     0     1     0
12     E     5     5     8
13     E     2     0     7
14     E     8     8     3

#### 기본적인 사용법

In [12]:
df_gb_index = df.groupby('index').mean()
df_gb_index

       col1      col2      col3
index
A      2.50  5.500000  4.500000
B      1.00  1.666667  4.666667
C      0.00  3.666667  6.333333
D      1.75  4.000000  2.750000
E      5.00  4.333333  6.000000

#### 추가 메소드 사용

In [13]:
df_gb_count = df.groupby('index').count()
df_gb_count

       col1  col2  col3
index
A         2     2     2
B         3     3     3
C         3     3     3
D         4     4     4
E         3     3     3

In [14]:
df_gb_agg = df.groupby('index').agg(['sum','mean'])
df_gb_agg

      col1       col2           col3
       sum  mean  sum      mean  sum      mean
index
A        5  2.50   11  5.500000    9  4.500000
B        3  1.00    5  1.666667   14  4.666667
C        0  0.00   11  3.666667   19  6.333333
D        7  1.75   16  4.000000   11  2.750000
E       15  5.00   13  4.333333   18  6.000000